netgmm/nailong_ai_robot/firmware/sdkconfig.defaults
# ESP32-S3-Box-3 语音对话终端 —— 默认 sdkconfig
# 目标芯片
CONFIG_IDF_TARGET="esp32s3"
# Flash 16MB
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
# PSRAM（8MB/16MB，音频 buffer 需要）
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_SPEED=80
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# CPU 240MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# 优化等级（音频/HTTP 处理建议 O2）
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# LVGL 字体：中文显示使用自定义字体 lv_font_simhei_16（GB2312 全量 7446 字，
# 由 simhei.ttf 用 lv_font_conv 生成，见 main/lv_font_simhei_16.c）。
# 因此关闭 LVGL 内置 1338 字 CJK 字体（省约 1.2MB flash），
# 默认字体用已启用的 Montserrat 14 兜底（代码中所有 Label 均显式指定中文字体）。
# 注意：LVGL 9.x 已移除 simsun 字体；本项目走 Kconfig 配置（LV_CONF_SKIP=y），
# esp-box 的 lv_conf.h 不会生效。
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
# CONFIG_LV_FONT_SOURCE_HAN_SANS_SC_16_CJK is not set
# CONFIG_LV_FONT_DEFAULT_SOURCE_HAN_SANS_SC_16_CJK is not set

# 自定义分区表：默认 factory 分区只有 1MB，装不下带 LVGL 的固件
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
